package com.chen.fy.wisdomscenicspot.utils;

/**
 * 景区景物描述类
 */
public class ScenicDescribeUtils {

    /**
     * 获取象鼻山的信息
     */
    public static String getElephantHillInfo() {
        return "象鼻山\n原名漓山，位于广西区桂林市内桃花江与漓江汇流处。\n" +
                "山因酷似一只站在江边伸鼻豪饮漓江甘泉的巨象而得名，被人们称为桂林山水的象征。\n" +
                "象鼻山以神奇著称。其神奇，首先是形神毕似，其次是在鼻腿之间造就一轮临水明月，构成“象山水月”奇景。\n";
    }

    /**
     * 获取普贤塔的信息
     */
    public static String getTown() {
        return "普贤塔\n在桂林市市区象鼻山顶，是一座喇嘛或实心砖塔，建于明代初期。塔身第二层正北面嵌有青石" +
                "线刻“南无普贤菩萨”。远看此塔，像插在象背一支剑柄或置于象背一只宝瓶,故亦有剑柄塔、宝瓶塔之称。";
    }

    /**
     * 获取普贤塔的信息
     */
    public static String getRuins() {
        return "桂林抗战遗址\n其是反映中国人民英勇抗击侵华日本的珍贵实物，包括象鼻山防空炮兵阵地、桂林保卫战中的" +
                "城防司令部旧址、象鼻山、叠彩山、铁峰山、鹦鹉山碉堡、普陀山老虎岩掩体等。";
    }

    /**
     * 获取狮岭朝霞的信息
     */
    public static String getSLZX() {
        return "狮岭朝霞展现在我们面前的是一幅由许多钟乳石组成的壮丽图\n" +
                "景：有挺拔的山峰，有茂密的森林，还有浓阴遮天的千年古树。\n" +
                "每当太阳初升就有成群的狮子迎着朝阳在森林里尽情地欢舞，使\n" +
                "整个森林充满了蓬蓬勃勃的朝气。\n" +
                "这里有一头大狮子，这是头部，这是身部，这是尾巴。\n" +
                "它正看护着那边的一群玩耍的小狮子，这个景叫“狮岭朝霞。\n" +
                "这些山峰、古树、狮子都是由洞顶滴水形成的钟乳石，含有钙离\n" +
                "子的水从裂缝中滴下来，经过上万年以至几十万年的积累，结晶成悬\n" +
                "挂在洞顶的石钟乳；水滴到地上，形成从下往上长的石笋；经过漫长\n" +
                "的年代，石笋和石钟乳连接起来，形成了石柱。\n" +
                "这一类由滴水形成的钟乳石称为滴石类次生化学沉积物。\n" +
                "中国有句成语说“水滴石穿，在芦笛岩却是水滴石长，只要有滴水\n" +
                "活动，钟乳石就会不停地生长。\n";
    }

    /**
     * 获取水晶宫的信息
     */
    public static String getSJG() {
        return "水晶宫这里是芦笛岩最宽阔的地方， 最宽处有93 米，最\n" +
                "高处18 米，大厅的左上方悬挂着一盏巨大的宫灯，把整个大厅染上了\n" +
                "一层神奇的色彩，好像是神话故事里东海龙王的水晶宫。\n" +
                "古地下湖的湖水顺着岩层溶蚀了整层岩石， 留下的层面平平整整，\n" +
                "成了这个大厅；第二，是因为这里的洞顶岩石比较完整、裂隙小，水\n" +
                "不能渗透下来，所以钟乳石也少。\n" +
                "洞底更显得平坦宽阔。\n" +
                "这里是古地下湖最深的地方，曾经是名副其实的水晶宫。\n" +
                "相传，这里是孙悟空大闹龙宫的地方。\n" +
                "孙悟空是我国神话传说中的神猴，他为了得到这根定海神针，和\n" +
                "龙王的虾兵蟹将打了起来。\n" +
                "看，这只水母在宫里飘来飘去，充当巡逻兵，那座镇海塔被孙悟\n" +
                "空打塌了半边，镇守大厅的大海螺也吃了孙悟空一棍，你看，螺壳被\n" +
                "打烂了。\n" +
                "那只小海螺怪机灵的，遇到危险就赶快溜，老孙只吹了一口气，\n" +
                "就把它吹穿了一个窟窿。\n" +
                "这条大鲤鱼见孙悟空这般厉害，吓得忙往泥里钻，只露出身子和\n" +
                "尾巴。\n" +
                "请注意，这条鲤鱼原是根石柱。\n" +
                "尾巴是石钟乳部分，身部是石笋部分，连接成石柱后，由于根基\n" +
                "黏土下沉，顶端被拉断离开了洞顶，成了一条钻入泥里的鲤鱼。\n" +
                "龙王不是孙悟空的对手，钻进龙池逃跑了。\n" +
                "龙王三太子自以为有点本事，也被孙悟空打得手软脚麻，呆呆地\n" +
                "站在那里。\n" +
                "看了这么久，大家还不知道孙悟空在哪里呢?你看，他胜利了，正\n" +
                "骑在大海螺上哩！\n";
    }

    /**
     * 获取水晶宫的信息
     */
    public static String getHLBZ() {
        return "红罗宝帐这像是一床圆顶蚊帐，这是帐顶，这是帐布，蚊帐的\n" +
                "一半已经整齐地折叠起来了。\n" +
                "帐顶叫穴盾，像古代兵器盾牌，国外叫它调色板。\n" +
                "穴盾由从洞壁裂缝挤压出来的渗透水形成。\n" +
                "水流形成穴盾上下两块圆形盾板，两块盾板中间是空的，水从盾\n" +
                "板夹缝向外流出，又形成了下部的石幔。\n" +
                "当石幔长达2—3 米时，石盾和石幔合起来就形成了盾帐，在外形\n" +
                "上宛如一床圆顶蚊帐。\n" +
                "盾帐右下方有一只美国火鸡，火鸡的尾巴上有一只小驼鸟。\n";
    }

    /**
     * 磁器口古镇
     */
    public static String getQCK() {
        return "磁器口古镇位于重庆主城区以西的沙坪坝区，因出产瓷器而得名。瓷器口镇东临嘉陵江，当年是非常热闹的一个水陆码头，后来随着公路的发展，码头逐渐的落败了。如今的磁器口，更多的是市民周末休闲、体验民风民俗的好去处。\n" +
                "\n" +
                "走在磁器口古镇的十几条街巷中，两旁边都是明清风格的建筑，脚下都是青石板路。当然，和其他都市附近的古镇一样，游客眼前的一切，都是近年来重新翻新的。不过这并不影响你在这里感受“老重庆”的风土人情。古镇不大，根据指示牌步行游览完全没有问题。\n" +
                "\n" +
                "你可以去镇里的钟家院、通家院等典型的川东山地民居参观；还可以去镇中的民俗文化村逛逛，这里常年举办川剧、评书等有当地特色的民俗文化活动。还可以和家人去镇里的千年古寺——宝轮寺敬香祈福，据说明朝建文帝曾在此隐居。";
    }

    /**
     * 解放碑步行街
     */
    public static String getJFB() {
        return "解放碑步行街位于重庆市渝中区，历来就是重庆最繁华的商业中心地带。这里有数量众多的百货公司、酒店、饭店等，是重庆购物、美食和走走逛逛的好去处，重庆时尚地标之一。当然，这里更是来重庆打望美女的绝佳去处。步行街以解放碑为中心，包括周边的民权路、民族路、邹容路和八一路和五一路等。\n" +
                "\n" +
                "商场多，小吃多，美女多，是步行街“三多”。你在这里可以逛逛“高大上”的美美时代百货、大都会广场，也有比较平民的重庆百货大楼和太平洋百货；在步行街上你几乎能吃到所有的重庆美食和小吃，这里有八一路好吃街，便宜又好吃的酸辣粉、山城小汤圆和抄手都能在这里找到。而当你步行街上闲逛时，没走几步，就会有一位身材高挑，皮肤白皙的重庆美眉从你身边闪过。\n" +
                "\n" +
                "作为重庆甚至是中国西部地区最繁华的商业街，无论你是“白富美”，还是“屌丝”；无论你是重庆本地人，还是来重庆的游客，在步行街都能找到属于自己的快乐。\n" +
                "\n" +
                "步行街上的解放碑，是全国唯一的一座纪念抗日战争胜利的纪念碑。步行街附近还有能仁寺、罗汉寺等景点。解放碑步行街及周边还是游客在重庆住宿的主要选择之一，这里有洲际酒店、JW万豪酒店等星级酒店，也有性价比很高的经济型酒店。";
    }

    /**
     * 武隆天生三桥
     */
    public static String getSQ() {
        return "天生三硚是中国南方喀斯特世界自然遗产核心景区，国家AAAAA级景区，国家地质公园。天生三硚属典型的喀斯特地貌景观，景区内以三座规模宏大、气势磅礴的天生石桥具有吸引力，石桥平均高300米以上，桥面跨度在500米以上，在一公里距离内就有如此高大的三座天生石桥为世界独有。景区内悬崖百丈、壁立千仞、飞泉流水、鸟语花香，山、水、瀑、峡、桥构成一幅完美的山水画卷。身临其境，将唤起您对大自然的敬畏之心。《变形金刚4》也曾在景区取景拍摄。";
    }

    /**
     * 大足石刻
     */
    public static String getDZSK() {
        return "大足石刻是世界文化遗产、国家首批5A景区、世界八大石窟之一，有“东方艺术明珠”之称，是世界石窟艺术的最后丰碑。大足石刻（The Dazu Rock Carvings），是唐末、宋初时期的宗教摩崖石刻，以佛教题材为主，尤以北山摩崖造像和宝顶山摩崖造像最为著名，是中国著名的古代石刻艺术。北山摩崖造像位于重庆市大足区城北1.5公里的北山。北山摩崖造像长约三百多米，是全国重点文物保护单位、世界文化遗产。造像最初开凿于晚唐景福元年（公元892年），历经后梁、后唐、后晋、后汉、后周五代至南宋1162年完成，历时250多年。现存雕刻造像四千六百多尊，是中国晚期石窟艺术中的优秀代表。";
    }

    /**
     * 白公馆
     */
    public static String getBGG() {
        return "白公馆原为四川大军阀白驹的别墅，1938年开始被国民党特务机关当作关押政治犯的秘密监狱。著名小说《红岩》就是以此为原型，真实再现了当年那段残酷而恐怖的囚禁生活和革命党人矢志不渝的鉴定革命信念。" +
                "白公馆位于重庆市沙坪坝郊区。是解放前国民党的秘密监狱，监狱背靠歌乐山  ，四周高墙、电网密布，墙外制高点上有岗亭和碉堡。大门终年紧闭，只有侧面开一小门与外界相通。狱内有牢房20间。抗日爱国将领黄显声，同济大学校长周均时，爱国人士廖承志，共产党员宋绮云，徐林侠夫妇及幼子“小萝卜头”等均曾被囚禁于此。1943年中美特种技术合作所成立后，白公馆改为招待所，其关押人员被迁往附近的渣滓洞。";
    }

    /**
     * 长江索道
     */
    public static String getCJSD() {
        return "特色1：日观山城，夜瞰灯海，不坐索道，白来重庆\n" +
                "\n" +
                "特色2：重庆城市符号，浪漫、文艺、风情、生动、立体的重庆旅游方式\n" +
                "\n" +
                "特色3：国家AAAA景区，重庆都市旅游空中观光景区，网红景区，打卡圣地\n" +
                "\n" +
                "特色4：穿梭高楼大厦之间、飞渡浩瀚大江之上、行游山水都市之巅，解读山城外形，体验重庆特色，享受“飞越山城，征服重庆”的豪情之美";
    }

    /**
     * 南山风景区
     */
    public static String getNS() {
        return "重庆南山风景区位于重庆长江南岸，并不是一座山，而是一片山脉。这里的一棵树观景台，是观赏山城夜景的好地方；南山植物园是重庆市民春赏花、夏避暑的去处；这里还有抗战博物馆。南山风景区号称重庆的后花园，景区内的南山植物园荟萃中外名花1000余种，是春日赏花的好去处。夏季这里的气温比市中心低几度，成为很多人散步乘凉的好去处。如果你对陪都的历史和建筑遗址有兴趣，不妨到抗战遗迹博物馆转一圈，这里众多的中西合璧的官邸和别墅一定会让你大饱眼福。还可以沿着黄桷古道会到达老君洞，一座依山而建的道观，始建于唐代。逛累了，还可以到附近闻名的泉水一条街大快朵颐，据说这里的泉水鸡是用本地泉水烹调的土鸡，味道很好。晚上到一棵树观景台感受一下重庆的夜景吧，观景台位于南山山腰，可以俯瞰渝中半岛、南岸区，包括两江汇合的景象，山灯与江水交相辉映。";
    }

    /**
     * 白帝城景区
     */
    public static String getBDC() {
        return "奉节白帝城，距奉节新县城8公里，位于长江三峡第一峡瞿塘峡西口，是长江三峡的起点。它濒临瞿塘，虎视夔门，孤峰独峙，气象森严，因距水陆要津，历来为兵家必争之地。" +
                "白帝城因西汉末年，公孙述据蜀，在此筑城，自号“白帝”而得名。又因三国时期刘备讨伐东吴，兵败白帝城，将家事、国事托于丞相诸葛亮而闻名于世。唐宋以来，李白、杜甫、白居易、陆游等历代大诗人在此留下大量诗篇，因此，白帝城又享有诗城之誉。白帝庙内的明良殿、武侯祠、观星亭等建筑均为明清所建，古朴典雅，庄严肃穆。" +
                "东西碑林、竹枝园、（东西碑林已迁移至竹枝园，现为竹枝园碑林）三峡木石艺术馆、古人悬棺馆以及新近开发的“三国卧龙茶苑”以其独具魅力的人文景观，使其长久以来都是中外闻名的旅游胜地。";
    }

    /**
     * 外滩
     */
    public static String getWT() {
        return "外滩是位于上海市中心黄浦江西岸外白渡桥至金陵东路之间的步行观光带，是最具上海城市象征意义的景点之一，万国建筑群、浦江夜景是这里最具魅力的景观。外滩全长1.5公里，由南向北漫步，左手边是宽阔的中山东一路，路边一字排开着数十栋风格迥异的外国建筑；右手边是上海的母亲河——黄浦江，江上巨轮穿梭，江对岸则矗立着东方明珠、金茂大厦、环球金融中心、上海中心大厦等摩天建筑。到了夜晚，浦江两岸霓虹齐放，适合与爱人漫步在外滩，感受着“不夜城”的韵味与浪漫，而夏季的外滩江风阵阵，更是乘凉的好去处。\n" +
                "\n" +
                "外滩景点丰富，最北边的是黄浦公园，上海人民英雄纪念塔在此屹然挺立，塔底是免费开放的外滩历史纪念馆，黄浦公园一旁是著名的外白渡桥，这里也是黄浦江与苏州河的交汇处；外滩中段有陈毅广场、“情人墙”、瀑布钟以及连接浦东和浦西的观光隧道的出入口；外滩最南端就是历史悠久的十六铺码头。此外，丰富的城市雕塑群也是外滩的一大看点。";
    }

    /**
     * 上海迪士尼度假区
     */
    public static String getDSN() {
        return "\uFEFF上海迪士尼度假区是一个特别为中国游客设计和打造的世界级家庭娱乐目的地。这里可供游客尽享多日休闲娱乐时光。整个度假区于2016年6月开幕，包括：\n" +
                "\n" +
                "一座主题乐园——适合所有人游玩、以神奇王国风格打造的“上海迪士尼乐园”，由六大主题园区组成，包括：“米奇大街”、“奇想花园”、“探险岛”、“明日世界”、“宝藏湾”及拥有“奇幻童话城堡”的“梦幻世界”。\n" +
                "\n" +
                "两座主题酒店——包括拥有420间客房、优雅别致的“上海迪士尼乐园酒店”以及拥有800间客房、充满童趣的“玩具总动员酒店”。\n" +
                "\n" +
                "一个国际级的购物餐饮娱乐区——“迪士尼小镇”，“华特迪士尼大剧院”将位于其中。\n" +
                "\n" +
                "一个由静谧的花园和波光粼粼的湖泊组成的休闲区——“星愿公园”，集美丽花园，惬意小道和波光粼粼的湖水于一身。\n" +
                "\n" +
                "上海迪士尼乐园于2016年6月盛大开幕，为所有年龄层的中国游客呈现令人流连忘返的神奇体验。您将可以探索一个前所未有的神奇世界，每个人都能在这里点亮心中奇梦。这就是上海迪士尼乐园，充满创造力、冒险精神与无穷精彩的快乐天地。您可在此游览全球较大的迪士尼城堡——奇幻童话城堡，探索别具一格又令人难忘的六大主题园区——米奇大街、奇想花园、梦幻世界、探险岛、宝藏湾和明日世界。";
    }

    /**
     * 南京路步行街
     */
    public static String getNJL_BXJ() {
        return "南京路步行街长约1200米，两侧商店林立，一眼望去，现代建筑夹杂着欧式老楼，竖挂的店铺灯箱连绵不绝，尤其夜幕之下霓虹灯光闪烁，别有风情。在这里逛一逛众多百货大楼和老字号商店，买写特色伴手礼回去，还可以坐一回像缩小版旧式电车的“铛铛车”，找找老上海的味道。";
    }

    /**
     * 上海长风海洋世界
     */
    public static String getCF_HYSJ() {
        return "上海长风海洋世界水族馆建于银锄湖底13米处，以自然海洋为主题，拥有超过300余种，万余海洋水生生物。共分为与鳐共舞、触摸星地带、世界热带雨林奇观、海马王国、缤纷珊瑚带、深海秘境、鲨鱼甬道、种类繁多的海洋生物、栩栩如生的主题造景、寓教于乐的创意互动，将人与自然完美融合。";
    }

    /**
     * 朱家角古镇景区
     */
    public static String getZJJ() {
        return "苍苍九峰北麓，茫茫淀山湖之滨，有块47平方公里成折扇形的小镇，镶嵌在湖光山色之中。有人把她比作上海的威尼斯，有人把她比作淀山湖畔一颗明珠，如今这颗璀璨明珠又在“金色玉带”—318国道的依托下，放射出更夺目的光彩。这就是闻名遐迩的千年古镇朱家角，1991年被上海市政府命名为首批四大文化名镇之一。名镇朱家角迷人的自然风光，在一山一湖。真山真水显现出江南水乡之特色，山名叫淀山，山虽不高，名气极大，为浙西天目余脉，此山为始，如登山望湖，有“淀峰晚照”一景可赏。湖，即天然淡水淀山湖，面积达62平方公里，湖东区大部分在朱家角境区，有11个杭州西湖面积大，乘艇游湖，茫茫水天一色，湖区芦苇轻摇，惊起野鸭水鸟，顿觉远离尘嚣，心旷神怡。名镇朱家角更迷人、更具古镇特色的人文景观，是一桥、一街、一寺、一庙、一厅、一馆、二园、三湾、二十六弄。如果说九百岁的水镇周庄小巧精致、似小家碧玉，而千年古镇朱家角则具气势磅礴、大家闺秀的风采。首先朱家角古镇面积达1.5平方公里，为周庄面积的三倍多，家大，自然游玩的地方就多，漕港河将朱家角分成两半，北岸井亭港，南岸北大街，两岸遍布蜿蜒曲折的小巷，花岗岩石的街面，青砖黛瓦的明清建筑及众多的历史遗迹。";
    }
}