package com.chen.fy.wisdomscenicspot.utils;

/**
 * 景区景物描述类
 */
public class ScenicDescribeUtils {

    /**
     * 获取象鼻山的信息
     */
    public static String getElephantHillInfo(){
        return "象鼻山原名漓山，位于广西区桂林市内桃花江与漓江汇流处，山因酷似一只站在江边伸鼻豪饮漓江甘泉的巨象而得名，被人们称为桂林山水的象征。\n" +
                "象鼻山以神奇著称。其神奇，首先是形神毕似，其次是在鼻腿之间造就一轮临水明月，构成“象山水月”奇景。因此，象鼻山是桂林的城徽山，是桂林旅游的标志山，它坐落在桂林市中心的漓江与桃花江汇流处，形似一头巨象，象鼻和象腿之间是面积约一百五十平米的圆洞，江水穿洞而过，如明月浮水。坐落西岸的象山水月与漓江东岸的穿月岩相对，一挂于天，一浮于水，形成“漓江双月”的奇特景观。\n" +
                "象鼻山主要景点有水月洞、象眼岩、普贤塔、宏峰寺及寺内的太平天国革命遗址陈列馆等。附近还有隋唐开元寺仅存的舍利塔。水月洞紧靠江边, 漓水流贯其间, 如水中浮月,山石垂入水中如象鼻饮水漓江, 景致极佳, 唐宋以来即为游览胜地。宋蓟北处士《和水月洞韵》诗: “水底有明月, 水上明月浮。水流月不去, 月去水还流。”形象地描绘了这一景致。国家首批AAAA级旅游景区，位于桂林市滨江路，桃花江与漓江的交汇处，2、23、16、57、58、88路公交车可到达。占地11.88万平方米，属于喀斯特地貌自然风景区，因山形酷似一匹豪饮江水的巨象而得名。早在唐宋就成为著名游览胜地，有1000多年的游览史 [1]  。\n" +
                "2017年与两江四湖景区共同升为国家AAAAA级旅游景区。 [2] ";
    }

}
