package com.chen.fy.wisdomscenicspot.utils;

/**
 * 景区景物描述类
 */
public class ScenicDescribeUtils {

    /**
     * 获取象鼻山的信息
     */
    public static String getElephantHillInfo(){
        return "象鼻山\n原名漓山，位于广西区桂林市内桃花江与漓江汇流处。\n" +
                "山因酷似一只站在江边伸鼻豪饮漓江甘泉的巨象而得名，被人们称为桂林山水的象征。\n" +
                "象鼻山以神奇著称。其神奇，首先是形神毕似，其次是在鼻腿之间造就一轮临水明月，构成“象山水月”奇景。\n";
    }

    /**
     * 获取普贤塔的信息
     */
    public static String getTown(){
        return "普贤塔\n在桂林市市区象鼻山顶，是一座喇嘛或实心砖塔，建于明代初期。塔身第二层正北面嵌有青石" +
                "线刻“南无普贤菩萨”。远看此塔，像插在象背一支剑柄或置于象背一只宝瓶,故亦有剑柄塔、宝瓶塔之称。";
    }

    /**
     * 获取普贤塔的信息
     */
    public static String getRuins(){
        return "桂林抗战遗址\n其是反映中国人民英勇抗击侵华日本的珍贵实物，包括象鼻山防空炮兵阵地、桂林保卫战中的" +
                "城防司令部旧址、象鼻山、叠彩山、铁峰山、鹦鹉山碉堡、普陀山老虎岩掩体等。";
    }

    /**
     * 获取狮岭朝霞的信息
     */
    public static String getSLZX(){
        return "狮岭朝霞展现在我们面前的是一幅由许多钟乳石组成的壮丽图\n" +
                "景：有挺拔的山峰，有茂密的森林，还有浓阴遮天的千年古树。\n" +
                "每当太阳初升就有成群的狮子迎着朝阳在森林里尽情地欢舞，使\n" +
                "整个森林充满了蓬蓬勃勃的朝气。\n" +
                "这里有一头大狮子，这是头部，这是身部，这是尾巴。\n" +
                "它正看护着那边的一群玩耍的小狮子，这个景叫“狮岭朝霞。\n" +
                "这些山峰、古树、狮子都是由洞顶滴水形成的钟乳石，含有钙离\n" +
                "子的水从裂缝中滴下来，经过上万年以至几十万年的积累，结晶成悬\n" +
                "挂在洞顶的石钟乳；水滴到地上，形成从下往上长的石笋；经过漫长\n" +
                "的年代，石笋和石钟乳连接起来，形成了石柱。\n" +
                "这一类由滴水形成的钟乳石称为滴石类次生化学沉积物。\n" +
                "中国有句成语说“水滴石穿，在芦笛岩却是水滴石长，只要有滴水\n" +
                "活动，钟乳石就会不停地生长。\n";
    }

    /**
     * 获取水晶宫的信息
     */
    public static String getSJG(){
        return "水晶宫这里是芦笛岩最宽阔的地方， 最宽处有93 米，最\n" +
                "高处18 米，大厅的左上方悬挂着一盏巨大的宫灯，把整个大厅染上了\n" +
                "一层神奇的色彩，好像是神话故事里东海龙王的水晶宫。\n" +
                "古地下湖的湖水顺着岩层溶蚀了整层岩石， 留下的层面平平整整，\n" +
                "成了这个大厅；第二，是因为这里的洞顶岩石比较完整、裂隙小，水\n" +
                "不能渗透下来，所以钟乳石也少。\n" +
                "洞底更显得平坦宽阔。\n" +
                "这里是古地下湖最深的地方，曾经是名副其实的水晶宫。\n" +
                "相传，这里是孙悟空大闹龙宫的地方。\n" +
                "孙悟空是我国神话传说中的神猴，他为了得到这根定海神针，和\n" +
                "龙王的虾兵蟹将打了起来。\n" +
                "看，这只水母在宫里飘来飘去，充当巡逻兵，那座镇海塔被孙悟\n" +
                "空打塌了半边，镇守大厅的大海螺也吃了孙悟空一棍，你看，螺壳被\n" +
                "打烂了。\n" +
                "那只小海螺怪机灵的，遇到危险就赶快溜，老孙只吹了一口气，\n" +
                "就把它吹穿了一个窟窿。\n" +
                "这条大鲤鱼见孙悟空这般厉害，吓得忙往泥里钻，只露出身子和\n" +
                "尾巴。\n" +
                "请注意，这条鲤鱼原是根石柱。\n" +
                "尾巴是石钟乳部分，身部是石笋部分，连接成石柱后，由于根基\n" +
                "黏土下沉，顶端被拉断离开了洞顶，成了一条钻入泥里的鲤鱼。\n" +
                "龙王不是孙悟空的对手，钻进龙池逃跑了。\n" +
                "龙王三太子自以为有点本事，也被孙悟空打得手软脚麻，呆呆地\n" +
                "站在那里。\n" +
                "看了这么久，大家还不知道孙悟空在哪里呢?你看，他胜利了，正\n" +
                "骑在大海螺上哩！\n";
    }

    /**
     * 获取水晶宫的信息
     */
    public static String getHLBZ(){
        return "红罗宝帐这像是一床圆顶蚊帐，这是帐顶，这是帐布，蚊帐的\n" +
                "一半已经整齐地折叠起来了。\n" +
                "帐顶叫穴盾，像古代兵器盾牌，国外叫它调色板。\n" +
                "穴盾由从洞壁裂缝挤压出来的渗透水形成。\n" +
                "水流形成穴盾上下两块圆形盾板，两块盾板中间是空的，水从盾\n" +
                "板夹缝向外流出，又形成了下部的石幔。\n" +
                "当石幔长达2—3 米时，石盾和石幔合起来就形成了盾帐，在外形\n" +
                "上宛如一床圆顶蚊帐。\n" +
                "盾帐右下方有一只美国火鸡，火鸡的尾巴上有一只小驼鸟。\n";
    }


}
