package com.chen.fy.wisdomscenicspot.utils;

import android.annotation.SuppressLint;

import java.text.SimpleDateFormat;
import java.util.Date;

/**
 * 景区景物描述类
 */
public class ScenicDescribeUtils {

    /**
     * 获取象鼻山的信息
     */
    public static String getElephantHillInfo(){
        return "象鼻山原名漓山，位于广西区桂林市内桃花江与漓江汇流处，山因酷似一只站在江边伸鼻豪饮漓" +
                "江甘泉的巨象而得名，被人们称为桂林山水的象征。象鼻山以神奇著称。其神奇，首先是形神" +
                "毕似，其次是在鼻腿之间造就一轮临水明月，构成" +
                "“象山水月”奇景。因此，象鼻山是桂林的城徽山，是桂林旅游的标志山，它坐落在桂林市中心" +
                "的漓江与桃花江汇流处，形似一头巨象，象鼻和象腿之间是面积约一百五十平米的圆洞，江水穿洞而过，" +
                "如明月浮水。坐落西岸的象山水月与漓江东岸的穿月岩相对，一挂于天，一浮于水，形成“漓江双月”的奇特景观。\n" +
                "象鼻山主要景点有水月洞、象眼岩、普贤塔、宏峰寺及寺内的太平天国革命遗址陈列馆等。附近还有隋唐" +
                "开元寺仅存的舍利塔。水月洞紧靠江边, 漓水流贯其间, 如水中浮月,山石垂入水中如象鼻饮水漓江, " +
                "景致极佳, 唐宋以来即为游览胜地。宋蓟北处士《和水月洞韵》诗: “水底有明月, 水上明月浮。" +
                "水流月不去, 月去水还流。”形象地描绘了这一景致。";
    }

    /**
     * 获取普贤塔的信息
     */
    public static String getTown(){
        return "普贤塔，在桂林市市区象鼻山顶，是一座喇嘛或实心砖塔，建于明代初期。塔身第二层正北面嵌有青石" +
                "线刻“南无普贤菩萨”。远看此塔，像插在象背一支剑柄或置于象背一只宝瓶,故亦有剑柄塔、宝瓶塔之称。";
    }

}
